{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_1","layers":[{"class_name":"InputLayer","config":{"batch_input_shape":[null,115,115,1],"dtype":"float32","sparse":false,"name":"input1"}},{"class_name":"Rescaling","config":{"scale":0.00392156862745098,"offset":0,"name":"rescaling_Rescaling1","trainable":true}},{"class_name":"Conv2D","config":{"filters":6,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[15,15],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D1","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization1","trainable":true}},{"class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D1","trainable":true}},{"class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[15,15],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D2","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization2","trainable":true}},{"class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D2","trainable":true}},{"class_name":"Conv2D","config":{"filters":120,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[15,15],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D3","trainable":true}},{"class_name":"Flatten","config":{"name":"flatten_Flatten1","trainable":true}},{"class_name":"Dense","config":{"units":200,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization3","trainable":true}},{"class_name":"Dense","config":{"units":50,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization4","trainable":true}},{"class_name":"Dense","config":{"units":3,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3","trainable":true}}]},"keras_version":"tfjs-layers 4.20.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.20.0","convertedBy":null,"weightsManifest":[{"paths":["./model.weights.bin"],"weights":[{"name":"conv2d_Conv2D1/kernel","shape":[15,15,1,6],"dtype":"float32"},{"name":"conv2d_Conv2D1/bias","shape":[6],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/gamma","shape":[6],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/beta","shape":[6],"dtype":"float32"},{"name":"conv2d_Conv2D2/kernel","shape":[15,15,6,16],"dtype":"float32"},{"name":"conv2d_Conv2D2/bias","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/gamma","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/beta","shape":[16],"dtype":"float32"},{"name":"conv2d_Conv2D3/kernel","shape":[15,15,16,120],"dtype":"float32"},{"name":"conv2d_Conv2D3/bias","shape":[120],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[1920,200],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[200],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/gamma","shape":[200],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/beta","shape":[200],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[200,50],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[50],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/gamma","shape":[50],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/beta","shape":[50],"dtype":"float32"},{"name":"dense_Dense3/kernel","shape":[50,3],"dtype":"float32"},{"name":"dense_Dense3/bias","shape":[3],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_mean","shape":[6],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_variance","shape":[6],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_mean","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_variance","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_mean","shape":[200],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_variance","shape":[200],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/moving_mean","shape":[50],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/moving_variance","shape":[50],"dtype":"float32"}]}]}